{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.8", "config": {"layers": [{"class_name": "InputLayer", "name": "state_1", "config": {"sparse": false, "name": "state_1", "batch_input_shape": [null, 21, 1], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv1D", "name": "conv1d_79", "config": {"trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 16, "name": "conv1d_79", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "kernel_size": [4], "dilation_rate": [1], "strides": [1], "padding": "valid", "activation": "relu"}, "inbound_nodes": [[["state_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_80", "config": {"trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 16, "name": "conv1d_80", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "kernel_size": [3], "dilation_rate": [1], "strides": [1], "padding": "valid", "activation": "relu"}, "inbound_nodes": [[["conv1d_79", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_81", "config": {"trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 8, "name": "conv1d_81", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "kernel_size": [3], "dilation_rate": [1], "strides": [1], "padding": "valid", "activation": "relu"}, "inbound_nodes": [[["conv1d_80", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_27", "config": {"trainable": true, "strides": [2], "name": "max_pooling1d_27", "padding": "valid", "pool_size": [2]}, "inbound_nodes": [[["conv1d_81", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_27", "config": {"trainable": true, "name": "flatten_27"}, "inbound_nodes": [[["max_pooling1d_27", 0, 0, {}]]]}, {"class_name": "InputLayer", "name": "state_2", "config": {"sparse": false, "name": "state_2", "batch_input_shape": [null, 2], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Concatenate", "name": "concatenate_27", "config": {"trainable": true, "axis": -1, "name": "concatenate_27"}, "inbound_nodes": [[["flatten_27", 0, 0, {}], ["state_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_105", "config": {"trainable": true, "kernel_constraint": null, "units": 64, "activity_regularizer": null, "name": "dense_105", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu"}, "inbound_nodes": [[["concatenate_27", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_106", "config": {"trainable": true, "kernel_constraint": null, "units": 32, "activity_regularizer": null, "name": "dense_106", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu"}, "inbound_nodes": [[["dense_105", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_107", "config": {"trainable": true, "kernel_constraint": null, "units": 32, "activity_regularizer": null, "name": "dense_107", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu"}, "inbound_nodes": [[["dense_106", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_108", "config": {"trainable": true, "kernel_constraint": null, "units": 45, "activity_regularizer": null, "name": "dense_108", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["dense_107", 0, 0, {}]]]}], "output_layers": [["dense_108", 0, 0]], "name": "model_27", "input_layers": [["state_1", 0, 0], ["state_2", 0, 0]]}}